src/boundaryConditions/dynContactAngleModel/robinBC/hetro2D_25_wg/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\	  /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format	ascii;
    class	volVectorField;
    object	U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }

    phylic
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    phobic
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottomEmptyFaces
    {
        type    empty;
    }

    topEmptyFaces
    {
        type    empty;
    }
}


// ************************************************************************* //

