src/boundaryConditions/dynContactAngleModel/robinBC/hetro2D_25_wg/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxCellSize     0.0001;

surfaceFile     "geom.fms";
/*
objectRefinements
{
        box
	{
                type            box;
                cellSize        0.00002;
                centre          (0.0352 0 0);
                lengthX         0.001;
                lengthY         0.0015;
                lengthZ         0.001;
        }
}


boundaryLayers
{
    "wall2"
    {
    	nLayers         6;
    	thicknessRatio  1.2;
    }
    "wall3"
    {
        nLayers         6;
        thicknessRatio  1.2;
    }
    "wall4"
    {
        nLayers         6;
        thicknessRatio  1.2;
    }

}
*/
// ************************************************************************* //
