src/boundaryConditions/dynContactAngleModel/robinBC/hetro2D_25_wg/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\	  /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format	ascii;
    class	dictionary;
    location    "system";
    object	setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field       "alpha.water_glycerol";
type        cylinder;
radius      0.0025;
direction   (0 1 0);
origin       (0.0175 0.0 #eval{-cos(90*3.14/180)*$radius});
//origin      (0.0175 0.0 0.0);

// ************************************************************************* //


